Revit 2027 API
DistributionSysType.NumWires Property
 Get or set number of wires of distribution system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumWires { get; set; }
Public Property NumWires As Integer
	Get
	Set
public:
property int NumWires {
	int get ();
	void set (int value);
}
member NumWires : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException | While assign a negative value to NumWires.
See Also
Reference
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace